# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.


a = 1
b = 1.1
c = "string"
d = {1, 2, 3, 4}
e = True

print(type(a))
print(type(b))
print(type(c))
print(type(d))
print(type(e))
